In [4]:
import numpy as np
import pandas as pd

In [5]:
df1 = pd.read_csv("first_file.csv")
df2 = pd.read_csv("second_file.csv")
df3 = pd.read_csv("third_file.csv")

In [6]:
df1

    id   age  height  weight
0  101  24.0     175      85
1  102  25.0     165      75
2  103  30.0     168      72
3  104   NaN     172      78
4  105  28.0     170      76

In [7]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      5 non-null      int64
 1   age     4 non-null      float64
 2   height  5 non-null      int64
 3   weight  5 non-null      int64
dtypes: float64(1), int64(3)
memory usage: 292.0 bytes

In [8]:
df1.isnull().sum()

id        0
age       1
height    0
weight    0
dtype: int64

In [9]:
df1["age"].mean()

26.75

In [10]:
df1.describe()

               id        age      height     weight
count    5.000000   4.000000    5.000000   5.000000
mean   103.000000  26.750000  170.000000  77.200000
std      1.581139   2.753785    3.807887   4.868265
min    101.000000  24.000000  165.000000  72.000000
25%    102.000000  24.750000  168.000000  75.000000
50%    103.000000  26.500000  170.000000  76.000000
75%    104.000000  28.500000  172.000000  78.000000
max    105.000000  30.000000  175.000000  85.000000

In [11]:
d1 = int(df1["age"].mean())
d1

26

In [12]:
df1["age"].fillna(value = d1,inplace = True)

C:\Users\Kaustubh Jadhav\AppData\Local\Temp\ipykernel_15648\865439897.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df1["age"].fillna(value = d1,inplace = True)

In [13]:
df1

    id   age  height  weight
0  101  24.0     175      85
1  102  25.0     165      75
2  103  30.0     168      72
3  104  26.0     172      78
4  105  28.0     170      76

In [14]:
df2

    id  age  height  weight
0  106   28     174      68
1  107   32     168      76
2  108   37     158      73
3  109   40     176      80
4  110   30     169      85

In [15]:
df4 = pd.concat([df1,df2])
df4

    id   age  height  weight
0  101  24.0     175      85
1  102  25.0     165      75
2  103  30.0     168      72
3  104  26.0     172      78
4  105  28.0     170      76
0  106  28.0     174      68
1  107  32.0     168      76
2  108  37.0     158      73
3  109  40.0     176      80
4  110  30.0     169      85

In [16]:
df4 = pd.concat([df1,df2],ignore_index=True)
df4

    id   age  height  weight
0  101  24.0     175      85
1  102  25.0     165      75
2  103  30.0     168      72
3  104  26.0     172      78
4  105  28.0     170      76
5  106  28.0     174      68
6  107  32.0     168      76
7  108  37.0     158      73
8  109  40.0     176      80
9  110  30.0     169      85

In [17]:
df3

  Gender   BP
0      M  120
1      F  140
2      M  145
3      F  132
4      M  130
5      F  150
6      M  147
7      F  132
8      F  128
9      F  130

In [18]:
df5 = pd.concat([df4,df3], axis = 1)
df5

    id   age  height  weight Gender   BP
0  101  24.0     175      85      M  120
1  102  25.0     165      75      F  140
2  103  30.0     168      72      M  145
3  104  26.0     172      78      F  132
4  105  28.0     170      76      M  130
5  106  28.0     174      68      F  150
6  107  32.0     168      76      M  147
7  108  37.0     158      73      F  132
8  109  40.0     176      80      F  128
9  110  30.0     169      85      F  130

In [19]:
df5["weight"].mean()

76.8

In [20]:
df5.groupby("Gender").groups

{'F': [1, 3, 5, 7, 8, 9], 'M': [0, 2, 4, 6]}

In [21]:
d2 = df5.groupby("Gender")["weight"].mean()
d2

Gender
F    76.50
M    77.25
Name: weight, dtype: float64